app/controllers/sites_controller.rb

  def index
    @sites = Site.all
---
SELECT * FROM "sites"

  def create
    @site = Site.new(params[:site])

    if @site.save
---
INSERT INTO "sites" ("name", "url", "description", "created_at", "updated_at") VALUES('Brociety', 'http://www.brociety.com/', 'If there’s one thing we’ve learned over the years, it’s that when you drink too much of the Whiskey, there’s only one cure: strappin’ in and riding ‘til your face freezes off. So we let the Militia have the warm months ... Brociety is here for the endless winter. There’s a lot to consider when it comes to divvying up your funds: dog food, human food, shiny objects, gas for the ol’ rustmobile. All those things add up, making it hard to scrounge the cash for a new board, a jacket your older brother hasn’t worn, or bindings with all the original straps, all while maintaining your steeze. Brociety knows the score. And we’re here to make sure you can get the board, the binders, and the jacket and still have enough leftover to feed X-Ray Dog the SuperBeagle.

  def show
    @site = Site.find(params[:id])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 1)